In [108]:
# Importing the libraries
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

In [109]:
# Importing the dataset
datasets = pd.read_csv('Data.csv')
type(datasets)

pandas.core.frame.DataFrame

In [110]:
# Given dataset contains:
datasets.head(1)

  Country   Age   Salary Purchased
0  France  44.0  72000.0        No

In [111]:
X = datasets.iloc[:, :-1]

In [112]:
X

   Country   Age   Salary
0   France  44.0  72000.0
1    Spain  27.0  48000.0
2  Germany  30.0  54000.0
3    Spain  38.0  61000.0
4  Germany  40.0      NaN
5   France  35.0  58000.0
6    Spain   NaN  52000.0
7   France  48.0  79000.0
8  Germany  50.0  83000.0
9   France  37.0  67000.0

In [113]:
X = datasets.iloc[:, :-1].values

In [114]:
X

array([['France', 44.0, 72000.0],
       ['Spain', 27.0, 48000.0],
       ['Germany', 30.0, 54000.0],
       ['Spain', 38.0, 61000.0],
       ['Germany', 40.0, nan],
       ['France', 35.0, 58000.0],
       ['Spain', nan, 52000.0],
       ['France', 48.0, 79000.0],
       ['Germany', 50.0, 83000.0],
       ['France', 37.0, 67000.0]], dtype=object)

In [115]:
Y = datasets.iloc[:, 3].values

In [116]:
Y

array(['No', 'Yes', 'No', 'No', 'Yes', 'Yes', 'No', 'Yes', 'No', 'Yes'], dtype=object)

### Missing Data

In [117]:
from sklearn.preprocessing import Imputer

In [ ]:
imputer = Imputer(missing_values='NaN',)